src/cfe/DataProcessors/кбп_МоиЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>кбп_МоиЗадачи</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cfe/Catalogs/кбп_СхемыПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>кбп_СхемыПроцессов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ВерсииСхем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Черновик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ВерсииСхем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретВторогоЭкземпляра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаскадноеПрерывание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПравилаЗапуска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кбп_СобытияЗапуска</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расписание</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсключенияЗапуска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКРеквизиту</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/DataProcessors/кбп_МоиЗадачи/Forms/ЗапускПроцесса/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Схема") И ЗначениеЗаполнено(Параметры.Схема) Тогда
		Схема = Параметры.Схема;
	КонецЕсли;
	ПредметЗадан = Ложь;
	Если Параметры.Свойство("Предмет") И ЗначениеЗаполнено(Параметры.Предмет) Тогда
		// Запуск из формы объекта: предмет задан, выбираются только схемы для его типа.
		Предмет = Параметры.Предмет;
		ПредметЗадан = Истина;
		ПолноеИмя = Предмет.Метаданные().ПолноеИмя();
		Элементы.Схема.ПараметрыВыбора = Новый ФиксированныйМассив(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Новый ПараметрВыбора("Отбор.ТипПредмета", ПолноеИмя)));
		Если Не ЗначениеЗаполнено(Схема) Тогда
			Схемы = СхемыДляТипа(ПолноеИмя);
			Если Схемы.Количество() = 0 Тогда
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
					НСтр("ru = 'Для «%1» нет опубликованных схем процессов.'"), Метаданные.НайтиПоПолномуИмени(ПолноеИмя).Представление()));
			ИначеЕсли Схемы.Количество() = 1 Тогда
				Схема = Схемы[0];
			КонецЕсли;
		КонецЕсли;
		Заголовок = СтрШаблон(НСтр("ru = 'Запуск процесса: %1'"), Предмет);
	КонецЕсли;
	НастроитьПредмет();
	Если ПредметЗадан Тогда
		Предмет = Параметры.Предмет;
		Элементы.Предмет.Видимость = Истина;
		Элементы.Предмет.ТолькоПросмотр = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СхемаПриИзменении(Элемент)
	НастроитьПредмет();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Запустить(Команда)

	Если Не ЗначениеЗаполнено(Схема) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выберите схему процесса.'"), , "Схема");
		Возврат;
	КонецЕсли;
	Процесс = ЗапуститьНаСервере();
	Оповестить("кбп_ЗапускПроцесса", Процесс);
	ПоказатьОповещениеПользователя(НСтр("ru = 'Процесс запущен'"), ПолучитьНавигационнуюСсылку(Процесс), Строка(Процесс));
	Закрыть();
	ПоказатьЗначение(, Процесс);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗапуститьНаСервере()
	Возврат кбп_Движок.ЗапуститьПроцесс(Схема, ?(ЗначениеЗаполнено(Предмет), Предмет, Неопределено), , Комментарий);
КонецФункции

&НаСервереБезКонтекста
Функция СхемыДляТипа(ПолноеИмя)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипПредмета", ПолноеИмя);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Схемы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.кбп_СхемыПроцессов КАК Схемы
	|ГДЕ
	|	Схемы.ТипПредмета = &ТипПредмета
	|	И НЕ Схемы.ПометкаУдаления
	|	И Схемы.ТекущаяВерсия <> ЗНАЧЕНИЕ(Справочник.кбп_ВерсииСхем.ПустаяСсылка)";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

// Тип предмета ограничивается типом из карточки схемы (ФТ-104).
&НаСервере
Процедура НастроитьПредмет()

	ТипПредмета = ?(ЗначениеЗаполнено(Схема), Схема.ТипПредмета, "");
	Элементы.Предмет.Видимость = ЗначениеЗаполнено(ТипПредмета);
	Если Не ЗначениеЗаполнено(ТипПредмета) Тогда
		Предмет = Неопределено;
		Возврат;
	КонецЕсли;

	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ТипПредмета);
	Если ОбъектМетаданных = Неопределено Тогда
		Элементы.Предмет.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	Части = СтрРазделить(ТипПредмета, ".");
	ОписаниеТипаПредмета = Новый ОписаниеТипов(Части[0] + "Ссылка." + Части[1]);
	Элементы.Предмет.ОграничениеТипа = ОписаниеТипаПредмета;
	Элементы.Предмет.Заголовок = ОбъектМетаданных.Представление();
	Предмет = ОписаниеТипаПредмета.ПривестиЗначение(Предмет);

КонецПроцедуры

#КонецОбласти
